====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====

TESTING FOR INPUT AND REPLACING MESSAGES:
20 Message(1, 4) "cats work for CIA!"
20 Message(2, 3) "the moon is made of cheese!"
20 Message(3, 2) "men are from venus and women are the sun!"
20 Message(4, 1) "humans will evolve back to dinosaurs!"

20 Message(5, 3) "really? god doesn't play dice?"
20 Message(6, 2) "super powers cause vanity"
20 Message(7, 1) "is it a plane, is it a bird, no its ..."
20 Message(8, 4) "Justin Trudeau is secretly a woman"

OUTPUT IS BELOW: 

PS C:\Users\Hydramin\Google Drive\YorkU\6th Year\EECS3221-Z Operating System Fundamentals\Assignments\Ass3\assign3> gcc -o alarm_cond  alarm_cond.c -D_POSIX_PTHREAD_SEMANTICS -lpthread; ./alarm_cond.exe
Alarm> 20 Message(1, 4) "cats work for CIA!"
Type A Alarm Request With Message Number (4) Inserted Into Alarm List at <1522119518>: <Type A>
[list:
N : 4, S : 20, Ty : 1, Ti : 1522119538, Msg : "cats work for CIA!"
]
Alarm> 20 Message(2, 3) "the moon is made of cheese!"
Type A Alarm Request With Message Number (3) Inserted Into Alarm List at <1522119518>: <Type A>
[list:
N : 3, S : 20, Ty : 2, Ti : 1522119538, Msg : "the moon is made of cheese!"
N : 4, S : 20, Ty : 1, Ti : 1522119538, Msg : "cats work for CIA!"
]
Alarm> 20 Message(3, 2) "men are from venus and women are the sun!"
Type A Alarm Request With Message Number (2) Inserted Into Alarm List at <1522119518>: <Type A>
[list:
N : 2, S : 20, Ty : 3, Ti : 1522119538, Msg : "men are from venus and women are the sun!"
N : 3, S : 20, Ty : 2, Ti : 1522119538, Msg : "the moon is made of cheese!"
N : 4, S : 20, Ty : 1, Ti : 1522119538, Msg : "cats work for CIA!"
]
Alarm> 20 Message(4, 1) "humans will evolve back to dinosaurs!"
Type A Alarm Request With Message Number (1) Inserted Into Alarm List at <1522119518>: <Type A>
[list:
N : 1, S : 20, Ty : 4, Ti : 1522119538, Msg : "humans will evolve back to dinosaurs!"
N : 2, S : 20, Ty : 3, Ti : 1522119538, Msg : "men are from venus and women are the sun!"
N : 3, S : 20, Ty : 2, Ti : 1522119538, Msg : "the moon is made of cheese!"
N : 4, S : 20, Ty : 1, Ti : 1522119538, Msg : "cats work for CIA!"
]
Alarm>
Alarm> 20 Message(5, 3) "really? god doesn't play dice?"
Type A Replacement Alarm Request With Message Number (3) Inserted Into Alarm List at <1522119518>: <Type A>
Stopped Displaying Replaced Alarm With Message Type (2) at <1522119518>: <Type A>
[list:
N : 1, S : 20, Ty : 4, Ti : 1522119538, Msg : "humans will evolve back to dinosaurs!"
N : 2, S : 20, Ty : 3, Ti : 1522119538, Msg : "men are from venus and women are the sun!"
N : 3, S : 20, Ty : 5, Ti : 1522119538, Msg : "really? god doesn't play dice?"
N : 4, S : 20, Ty : 1, Ti : 1522119538, Msg : "cats work for CIA!"
]
Alarm> 20 Message(6, 2) "super powers cause vanity"
Type A Replacement Alarm Request With Message Number (2) Inserted Into Alarm List at <1522119518>: <Type A>
Stopped Displaying Replaced Alarm With Message Type (3) at <1522119518>: <Type A>
[list:
N : 1, S : 20, Ty : 4, Ti : 1522119538, Msg : "humans will evolve back to dinosaurs!"
N : 2, S : 20, Ty : 6, Ti : 1522119538, Msg : "super powers cause vanity"
N : 3, S : 20, Ty : 5, Ti : 1522119538, Msg : "really? god doesn't play dice?"
N : 4, S : 20, Ty : 1, Ti : 1522119538, Msg : "cats work for CIA!"
]
Alarm> 20 Message(7, 1) "is it a plane, is it a bird, no its ..."
Type A Replacement Alarm Request With Message Number (1) Inserted Into Alarm List at <1522119518>: <Type A>
Stopped Displaying Replaced Alarm With Message Type (4) at <1522119518>: <Type A>
[list:
N : 1, S : 20, Ty : 7, Ti : 1522119538, Msg : "is it a plane, is it a bird, no its ..."
N : 2, S : 20, Ty : 6, Ti : 1522119538, Msg : "super powers cause vanity"
N : 3, S : 20, Ty : 5, Ti : 1522119538, Msg : "really? god doesn't play dice?"
N : 4, S : 20, Ty : 1, Ti : 1522119538, Msg : "cats work for CIA!"
]
Alarm> 20 Message(8, 4) "Justin Trudeau is secretly a woman"
Type A Replacement Alarm Request With Message Number (4) Inserted Into Alarm List at <1522119518>: <Type A>
Stopped Displaying Replaced Alarm With Message Type (1) at <1522119518>: <Type A>
[list:
N : 1, S : 20, Ty : 7, Ti : 1522119538, Msg : "is it a plane, is it a bird, no its ..."
N : 2, S : 20, Ty : 6, Ti : 1522119538, Msg : "super powers cause vanity"
N : 3, S : 20, Ty : 5, Ti : 1522119538, Msg : "really? god doesn't play dice?"
N : 4, S : 20, Ty : 8, Ti : 1522119538, Msg : "Justin Trudeau is secretly a woman"
]
Alarm>


====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====

TESTING THE INSERTION OF TYPE A ALARM REQUESTS, CREATION OF THREADS AND REPLACING TYPE A REQUESTS WHILE THEY ARE BEING PRINTED

20 Message(1, 4) "cats work for CIA!"
20 Message(2, 3) "the moon is made of cheese!"
20 Message(3, 2) "men are from venus and women are the sun!"
20 Message(4, 1) "humans will evolve back to dinosaurs!"

Create_Thread: MessageType(1)
Create_Thread: MessageType(2)
Create_Thread: MessageType(3)
Create_Thread: MessageType(4)

20 Message(5, 3) "really? god doesn't play dice?"
20 Message(6, 2) "super powers cause vanity"
20 Message(7, 1) "is it a plane, is it a bird, no its ..."
20 Message(8, 4) "Justin Trudeau is secretly a woman"

PS C:\Users\Hydramin\Google Drive\YorkU\6th Year\EECS3221-Z Operating System Fundamentals\Assignments\Ass3\assign3> gcc -o alarm_cond  alarm_cond.c -D_POSIX_PTHREAD_SEMANTICS -lpthread; ./alarm_cond.exe
Alarm> 20 Message(1, 4) "cats work for CIA!"
Type A Alarm Request With Message Number (4) Inserted Into Alarm List at <1522122781>: <Type A>
[list:
N : 4, S : 20, Ty : 1, Ti : 1522122801, Msg : "cats work for CIA!"
]
Alarm> 20 Message(2, 3) "the moon is made of cheese!"
Type A Alarm Request With Message Number (3) Inserted Into Alarm List at <1522122781>: <Type A>
[list:
N : 3, S : 20, Ty : 2, Ti : 1522122801, Msg : "the moon is made of cheese!"
N : 4, S : 20, Ty : 1, Ti : 1522122801, Msg : "cats work for CIA!"
]
Alarm> 20 Message(3, 2) "men are from venus and women are the sun!"
Type A Alarm Request With Message Number (2) Inserted Into Alarm List at <1522122781>: <Type A>
[list:
N : 2, S : 20, Ty : 3, Ti : 1522122801, Msg : "men are from venus and women are the sun!"
N : 3, S : 20, Ty : 2, Ti : 1522122801, Msg : "the moon is made of cheese!"
N : 4, S : 20, Ty : 1, Ti : 1522122801, Msg : "cats work for CIA!"
]
Alarm> 20 Message(4, 1) "humans will evolve back to dinosaurs!"
Type A Alarm Request With Message Number (1) Inserted Into Alarm List at <1522122781>: <Type A>
[list:
N : 1, S : 20, Ty : 4, Ti : 1522122801, Msg : "humans will evolve back to dinosaurs!"
N : 2, S : 20, Ty : 3, Ti : 1522122801, Msg : "men are from venus and women are the sun!"
N : 3, S : 20, Ty : 2, Ti : 1522122801, Msg : "the moon is made of cheese!"
N : 4, S : 20, Ty : 1, Ti : 1522122801, Msg : "cats work for CIA!"
]
Alarm>
Alarm> Create_Thread: MessageType(1)
Type B Create Thread Alarm Request For Message Type (1) Inserted Into Alarm List at <1522122781>!
List of Threads:
Thread Type: 1
Alarm> Create_Thread: MessageType(2)
Type B Create Thread Alarm Request For Message Type (2) Inserted Into Alarm List at <1522122781>!
List of Threads:
Thread Type: 1
Thread Type: 2
Alarm> Create_Thread: MessageType(3)
Type B Create Thread Alarm Request For Message Type (3) Inserted Into Alarm List at <1522122781>!
List of Threads:
Thread Type: 1
Thread Type: 2
Thread Type: 3
Alarm> Create_Thread: MessageType(4)
Type B Create Thread Alarm Request For Message Type (4) Inserted Into Alarm List at <1522122781>!
List of Threads:
Thread Type: 1
Thread Type: 2
Thread Type: 3
Thread Type: 4
Alarm> Type B Alarm Request Processed at <1522122782>: New Periodic Display Thread For Message Type (1) Created.
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 19
Type B Alarm Request Processed at <1522122782>: New Periodic Display Thread For Message Type (2) Created.
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 19
Type B Alarm Request Processed at <1522122782>: New Periodic Display Thread For Message Type (3) Created.
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 19
Type B Alarm Request Processed at <1522122782>: New Periodic Display Thread For Message Type (4) Created.
Printing message, Type : 4 , Number : 1 , Msg : "humans will evolve back to dinosaurs!" , Tim : 19
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 18
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 18
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 18
Printing message, Type : 4 , Number : 1 , Msg : "humans will evolve back to dinosaurs!" , Tim : 18
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 17
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 17
Printing message, Type : 4 , Number : 1 , Msg : "humans will evolve back to dinosaurs!" , Tim : 17
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 17
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 16
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 16
Printing message, Type : 4 , Number : 1 , Msg : "humans will evolve back to dinosaurs!" , Tim : 16
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 16
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 15
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 15
Printing message, Type : 4 , Number : 1 , Msg : "humans will evolve back to dinosaurs!" , Tim : 15
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 15
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 14
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 14
Printing message, Type : 4 , Number : 1 , Msg : "humans will evolve back to dinosaurs!" , Tim : 14
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 14
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 13
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 13
Printing message, Type : 4 , Number : 1 , Msg : "humans will evolve back to dinosaurs!" , Tim : 13
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 13
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 12
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 12
Printing message, Type : 4 , Number : 1 , Msg : "humans will evolve back to dinosaurs!" , Tim : 12
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 12
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 11
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 11
Printing message, Type : 4 , Number : 1 , Msg : "humans will evolve back to dinosaurs!" , Tim : 11
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 11
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 10
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 10
Printing message, Type : 4 , Number : 1 , Msg : "humans will evolve back to dinosaurs!" , Tim : 10
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 10
20 Message(5, 3) "really? god doesn't play dice?"
Type A Replacement Alarm Request With Message Number (3) Inserted Into Alarm List at <1522122792>: <Type A>
Stopped Displaying Replaced Alarm With Message Type (2) at <1522122792>: <Type A>
[list:
N : 1, S : 20, Ty : 4, Ti : 1522122801, Msg : "humans will evolve back to dinosaurs!"
N : 2, S : 20, Ty : 3, Ti : 1522122801, Msg : "men are from venus and women are the sun!"
N : 3, S : 20, Ty : 5, Ti : 1522122812, Msg : "really? god doesn't play dice?"
N : 4, S : 20, Ty : 1, Ti : 1522122801, Msg : "cats work for CIA!"
]
Alarm> 20 Message(6, 2) "super powers cause vanity"
Type A Replacement Alarm Request With Message Number (2) Inserted Into Alarm List at <1522122792>: <Type A>
Stopped Displaying Replaced Alarm With Message Type (3) at <1522122792>: <Type A>
[list:
N : 1, S : 20, Ty : 4, Ti : 1522122801, Msg : "humans will evolve back to dinosaurs!"
N : 2, S : 20, Ty : 6, Ti : 1522122812, Msg : "super powers cause vanity"
N : 3, S : 20, Ty : 5, Ti : 1522122812, Msg : "really? god doesn't play dice?"
N : 4, S : 20, Ty : 1, Ti : 1522122801, Msg : "cats work for CIA!"
]
Alarm> 20 Message(7, 1) "is it a plane, is it a bird, no its ..."
Type A Replacement Alarm Request With Message Number (1) Inserted Into Alarm List at <1522122792>: <Type A>
Stopped Displaying Replaced Alarm With Message Type (4) at <1522122792>: <Type A>
[list:
N : 1, S : 20, Ty : 7, Ti : 1522122812, Msg : "is it a plane, is it a bird, no its ..."
N : 2, S : 20, Ty : 6, Ti : 1522122812, Msg : "super powers cause vanity"
N : 3, S : 20, Ty : 5, Ti : 1522122812, Msg : "really? god doesn't play dice?"
N : 4, S : 20, Ty : 1, Ti : 1522122801, Msg : "cats work for CIA!"
]
Alarm> 20 Message(8, 4) "Justin Trudeau is secretly a woman"
Type A Replacement Alarm Request With Message Number (4) Inserted Into Alarm List at <1522122792>: <Type A>
Stopped Displaying Replaced Alarm With Message Type (1) at <1522122792>: <Type A>
[list:
N : 1, S : 20, Ty : 7, Ti : 1522122812, Msg : "is it a plane, is it a bird, no its ..."
N : 2, S : 20, Ty : 6, Ti : 1522122812, Msg : "super powers cause vanity"
N : 3, S : 20, Ty : 5, Ti : 1522122812, Msg : "really? god doesn't play dice?"
N : 4, S : 20, Ty : 8, Ti : 1522122812, Msg : "Justin Trudeau is secretly a woman"
]
Alarm> 
Type A Alarm Request Processed at <1522122792>: Periodic Display Thread For Message Type (1) Terminated: No more Alarm Requests For Message Type (1).
Type A Alarm Request Processed at <1522122792>: Periodic Display Thread For Message Type (4) Terminated: No more Alarm Requests For Message Type (4).
Type A Alarm Request Processed at <1522122792>: Periodic Display Thread For Message Type (2) Terminated: No more Alarm Requests For Message Type (2).
Type A Alarm Request Processed at <1522122792>: Periodic Display Thread For Message Type (3) Terminated: No more Alarm Requests For Message Type (3).

====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====

TESTING FOR CREATION OF THREADS AND DELETION OF TYPE A ALARM REQUESTS BY INPUTTING TYPE C ALARM REQUESTS

20 Message(1, 4) "cats work for CIA!"
20 Message(2, 3) "the moon is made of cheese!"
20 Message(3, 2) "men are from venus and women are the sun!"
20 Message(4, 1) "humans will evolve back to dinosaurs!"

Create_Thread: MessageType(1)
Create_Thread: MessageType(2)
Create_Thread: MessageType(3)
Create_Thread: MessageType(4)

Cancel: Message(4)
Cancel: Message(3)
Cancel: Message(1)

PS C:\Users\Hydramin\Google Drive\YorkU\6th Year\EECS3221-Z Operating System Fundamentals\Assignments\Ass3\assign3> gcc -o alarm_cond  alarm_cond.c -D_POSIX_PTHREAD_SEMANTICS -lpthread; ./alarm_cond.exe
Alarm> 20 Message(1, 4) "cats work for CIA!"
Type A Alarm Request With Message Number (4) Inserted Into Alarm List at <1522123097>: <Type A>
[list:
N : 4, S : 20, Ty : 1, Ti : 1522123117, Msg : "cats work for CIA!"
]
Alarm> 20 Message(2, 3) "the moon is made of cheese!"
Type A Alarm Request With Message Number (3) Inserted Into Alarm List at <1522123097>: <Type A>
[list:
N : 3, S : 20, Ty : 2, Ti : 1522123117, Msg : "the moon is made of cheese!"
N : 4, S : 20, Ty : 1, Ti : 1522123117, Msg : "cats work for CIA!"
]
Alarm> 20 Message(3, 2) "men are from venus and women are the sun!"
Type A Alarm Request With Message Number (2) Inserted Into Alarm List at <1522123097>: <Type A>
[list:
N : 2, S : 20, Ty : 3, Ti : 1522123117, Msg : "men are from venus and women are the sun!"
N : 3, S : 20, Ty : 2, Ti : 1522123117, Msg : "the moon is made of cheese!"
N : 4, S : 20, Ty : 1, Ti : 1522123117, Msg : "cats work for CIA!"
]
Alarm> 20 Message(4, 1) "humans will evolve back to dinosaurs!"
Type A Alarm Request With Message Number (1) Inserted Into Alarm List at <1522123097>: <Type A>
[list:
N : 1, S : 20, Ty : 4, Ti : 1522123117, Msg : "humans will evolve back to dinosaurs!"
N : 2, S : 20, Ty : 3, Ti : 1522123117, Msg : "men are from venus and women are the sun!"
N : 3, S : 20, Ty : 2, Ti : 1522123117, Msg : "the moon is made of cheese!"
N : 4, S : 20, Ty : 1, Ti : 1522123117, Msg : "cats work for CIA!"
]
Alarm>
Alarm> Create_Thread: MessageType(1)
Type B Create Thread Alarm Request For Message Type (1) Inserted Into Alarm List at <1522123097>!
List of Threads:
Thread Type: 1
Alarm> Create_Thread: MessageType(2)
Type B Create Thread Alarm Request For Message Type (2) Inserted Into Alarm List at <1522123097>!
List of Threads:
Thread Type: 1
Thread Type: 2
Alarm> Create_Thread: MessageType(3)
Type B Create Thread Alarm Request For Message Type (3) Inserted Into Alarm List at <1522123097>!
List of Threads:
Thread Type: 1
Thread Type: 2
Thread Type: 3
Alarm> Create_Thread: MessageType(4)Type B Alarm Request Processed at <1522123098>: New Periodic Display Thread For Message Type (1) Created.
Type B Alarm Request Processed at <1522123098>: New Periodic Display Thread For Message Type (2) Created.
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 19
Type B Alarm Request Processed at <1522123098>: New Periodic Display Thread For Message Type (3) Created.
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 19
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 19
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 18
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 18
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 18
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 17
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 17
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 17
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 16
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 16
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 16
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 15
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 15
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 15
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 14
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 14
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 14
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 13
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 13
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 13
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 12
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 12
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 12
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 11
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 11
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 11
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 10
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 10
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 10
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 9
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 9
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 9
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 8
Printing message, Type : 2 , Number : 3 , Msg : "the moon is made of cheese!" , Tim : 8
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 8
Cancel: Message(4)
Type B Create Thread Alarm Request For Message Type (4) Inserted Into Alarm List at <1522123110>!
List of Threads:
Thread Type: 1
Thread Type: 2
Thread Type: 3
Thread Type: 4
Alarm> Cancel: Message(3)
List of Removal_Requests:
Msg_Number: 3
Type C Cancel Alarm Request With Message Number (3) Inserted Into Alarm List at <1522123110>: <Type C>
Alarm> Cancel: Message(1)
List of Removal_Requests:
Msg_Number: 3
Msg_Number: 1
Type C Cancel Alarm Request With Message Number (1) Inserted Into Alarm List at <1522123110>: <Type C>
Alarm> Type B Alarm Request Processed at <1522123110>: New Periodic Display Thread For Message Type (4) Created.
[list:
Printing message, Type : 4 , Number : 1 , Msg : "humans will evolve back to dinosaurs!" , Tim : 7
N : 1, S : 20, Ty : 4, Ti : 1522123117, Msg : "humans will evolve back to dinosaurs!"
N : 2, S : 20, Ty : 3, Ti : 1522123117, Msg : "men are from venus and women are the sun!"
N : 4, S : 20, Ty : 1, Ti : 1522123117, Msg : "cats work for CIA!"
]
Type C Alarm Request Processed at <1522123110>: Alarm Request With Message Number (3) Removed
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 7
[list:
N : 2, S : 20, Ty : 3, Ti : 1522123117, Msg : "men are from venus and women are the sun!"
N : 4, S : 20, Ty : 1, Ti : 1522123117, Msg : "cats work for CIA!"
]
Type C Alarm Request Processed at <1522123110>: Alarm Request With Message Number (1) Removed
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 7
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 6
Type A Alarm Request Processed at <1522123111>: Periodic Display Thread For Message Type (2) Terminated: No more Alarm Requests For Message Type (2).
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 6
Type A Alarm Request Processed at <1522123112>: Periodic Display Thread For Message Type (4) Terminated: No more Alarm Requests For Message Type (4).
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 5
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 5
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 4
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 4
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 3
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 3
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 2
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 2
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 1
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 1
Printing message, Type : 1 , Number : 4 , Msg : "cats work for CIA!" , Tim : 0
Printing message, Type : 3 , Number : 2 , Msg : "men are from venus and women are the sun!" , Tim : 0
ALARM IS NOW DONE
[list:
N : 2, S : 20, Ty : 3, Ti : 1522123117, Msg : "men are from venus and women are the sun!"
]
ALARM IS NOW DONE
Type A Alarm Request Processed at <1522123119>: Periodic Display Thread For Message Type (1) Terminated: No more Alarm Requests For Message Type (1).
[list:
]
Type A Alarm Request Processed at <1522123119>: Periodic Display Thread For Message Type (3) Terminated: No more Alarm Requests For Message Type (3).

====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====

ERROR MESSAGES AS A RESULT OF ERRONEOUS INPUTS
1. INPUTING INCORRECT TYPE A ALARM REQUESTS

20 Message(-1, 4) "cats work for CIA!"
20 Message(1, -4) "cats work for CIA!"
-20 Message(1, 4) "cats work for CIA!"

PS C:\Users\Hydramin\Google Drive\YorkU\6th Year\EECS3221-Z Operating System Fundamentals\Assignments\Ass3\assign3> gcc -o alarm_cond  alarm_cond.c -D_POSIX_PTHREAD_SEMANTICS -lpthread; ./alarm_cond.exerm_cond  alarm_cond.c -D_POSIX_PTHREAD_SEMANTICS -lpthread; ./alarm_cond.exeAlarm> 20 Message(-1, 4) "cats work for CIA!"Bad Command. Usage:
Type A: <+ve integer> Message(Message_Type : <+ve integer>, Message_Number : <+ve integer>) <string message>
Type B: Create_Thread: MessageType(Message_Type : <+ve integer>)
Type C: Cancle: Message(Message_Number : <+ve integer>)

Alarm> 20 Message(1, -4) "cats work for CIA!"
Bad Command. Usage:Type A: <+ve integer> Message(Message_Type : <+ve integer>, Message_Number : <+ve integer>) <string message>
Type B: Create_Thread: MessageType(Message_Type : <+ve integer>)
Type C: Cancle: Message(Message_Number : <+ve integer>)

Alarm> -20 Message(1, 4) "cats work for CIA!"Bad Command. Usage:
Type A: <+ve integer> Message(Message_Type : <+ve integer>, Message_Number : <+ve integer>) <string message>
Type B: Create_Thread: MessageType(Message_Type : <+ve integer>)
Type C: Cancle: Message(Message_Number : <+ve integer>)
Alarm>
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
2. INPUTING INCORRECT TYPE B ALARM REQUESTS

Create_Thread: MessageType(-1)
Create_Thread: MessageType(2)

Alarm> Create_Thread: MessageType(-1)Bad Command. Usage:
Type A: <+ve integer> Message(Message_Type : <+ve integer>, Message_Number : <+ve integer>) <string message>
Type B: Create_Thread: MessageType(Message_Type : <+ve integer>)
Type C: Cancle: Message(Message_Number : <+ve integer>)

Alarm> Create_Thread: MessageType(2)
Type B Alarm Request Error: No Alarm Request With Message Type (2)!
Alarm>

====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====
====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====<<<<>>>>====

3. INPUTING INCORRECT TYPE C ALARM REQUESTS

Cancel: Message(4)
Cancel: Message(-3)

Alarm> Cancel: Message(4)Error: No Alarm Request With Message Number (4) to Cancel!

Alarm> Cancel: Message(-3)
Bad Command. Usage:
Type A: <+ve integer> Message(Message_Type : <+ve integer>, Message_Number : <+ve integer>) <string message>
Type B: Create_Thread: MessageType(Message_Type : <+ve integer>)
Type C: Cancle: Message(Message_Number : <+ve integer>)
Alarm>